apache/nuttx/arch/arm/src/lpc55xx/hardware/lpc55_usart.h
/*****************************************************************************************************
 * arch/arm/src/LPC55xx/chip/LPC55_usart.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *****************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC55XX_HARDWARE_LPC55_USART_H
#define __ARCH_ARM_SRC_LPC55XX_HARDWARE_LPC55_USART_H

/*****************************************************************************************************
 * Included Files
 *****************************************************************************************************/

#include <nuttx/config.h>
#include "hardware/lpc55_memorymap.h"

/*****************************************************************************************************
 * Pre-processor Definitions
 *****************************************************************************************************/

#define LPC55_USART_FIFO_DEPTH          16       /* All FIFOs are 16x8-bits */

/* USART Register Offsets ***************************************************************************/

/* Registers for the USART function: */

#define LPC55_USART_CFG_OFFSET          0x0000  /* USART Configuration register */
#define LPC55_USART_CTL_OFFSET          0x0004  /* USART Control register */
#define LPC55_USART_STAT_OFFSET         0x0008  /* USART Status register */
#define LPC55_USART_INTENSET_OFFSET     0x000c  /* USART Interrupt Enable read and Set register */
#define LPC55_USART_INTENCLR_OFFSET     0x0010  /* USART Interrupt Enable Clear register */
#define LPC55_USART_BRG_OFFSET          0x0020  /* USART Baud Rate Generator register */
#define LPC55_USART_INTSTAT_OFFSET      0x0024  /* USART Interrupt status register */
#define LPC55_USART_OSR_OFFSET          0x0028  /* USART Oversample selection register */
#define LPC55_USART_ADDR_OFFSET         0x002c  /* USART Address register */

/* Registers for FIFO control and data access: */

#define LPC55_USART_FIFOCFG_OFFSET      0x0e00  /* FIFO configuration and enable register */
#define LPC55_USART_FIFOSTAT_OFFSET     0x0e04  /* FIFO status register */
#define LPC55_USART_FIFOTRIG_OFFSET     0x0e08  /* FIFO trigger settings for interrupt and DMA request */
#define LPC55_USART_FIFOINTENSET_OFFSET 0x0e10  /* FIFO interrupt enable set (enable) and read register */
#define LPC55_USART_FIFOINTENCLR_OFFSET 0x0e14  /* FIFO interrupt enable clear (disable) and read register */
#define LPC55_USART_FIFOINTSTAT_OFFSET  0x0e18  /* FIFO interrupt status register */
#define LPC55_USART_FIFOWR_OFFSET       0x0e20  /* FIFO write data */
#define LPC55_USART_FIFORD_OFFSET       0x0e30  /* FIFO read data */
#define LPC55_USART_FIFORDNOPOP_OFFSET  0x0e40  /* FIFO data read with no FIFO pop */
#define LPC55_USART_FIFOSIZE_OFFSET     0x0e48  /* FIFO Size */

/* ID register: */

#define LPC55_USART_ID_OFFSET           0x0ffc  /* USART module Identification */

/* USART Register Adreesses **************************************************************************/

#define LPC55_USART0_CFG                (LPC55_FLEXCOMM0_BASE + LPC55_USART_CFG_OFFSET)
#define LPC55_USART0_CTL                (LPC55_FLEXCOMM0_BASE + LPC55_USART_CTL_OFFSET)
#define LPC55_USART0_STAT               (LPC55_FLEXCOMM0_BASE + LPC55_USART_STAT_OFFSET)
#define LPC55_USART0_INTENSET           (LPC55_FLEXCOMM0_BASE + LPC55_USART_INTENSET_OFFSET)
#define LPC55_USART0_INTENCLR           (LPC55_FLEXCOMM0_BASE + LPC55_USART_INTENCLR_OFFSET)
#define LPC55_USART0_BRG                (LPC55_FLEXCOMM0_BASE + LPC55_USART_BRG_OFFSET)
#define LPC55_USART0_INTSTAT            (LPC55_FLEXCOMM0_BASE + LPC55_USART_INTSTAT_OFFSET)
#define LPC55_USART0_OSR                (LPC55_FLEXCOMM0_BASE + LPC55_USART_OSR_OFFSET)
#define LPC55_USART0_ADDR               (LPC55_FLEXCOMM0_BASE + LPC55_USART_ADDR_OFFSET)
#define LPC55_USART0_FIFOCFG            (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFOCFG_OFFSET)
#define LPC55_USART0_FIFOSTAT           (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFOSTAT_OFFSET)
#define LPC55_USART0_FIFOTRIG           (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFOTRIG_OFFSET)
#define LPC55_USART0_FIFOINTENSET       (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFOINTENSET_OFFSET)
#define LPC55_USART0_FIFOINTENCLR       (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFOINTENCLR_OFFSET)
#define LPC55_USART0_FIFOINTSTAT        (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFOINTSTAT_OFFSET)
#define LPC55_USART0_FIFOWR             (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFOWR_OFFSET)
#define LPC55_USART0_FIFORD             (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFORD_OFFSET)
#define LPC55_USART0_FIFORDNOPOP        (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFORDNOPOP_OFFSET)
#define LPC55_USART0_FIFOSIZE           (LPC55_FLEXCOMM0_BASE + LPC55_USART_FIFOSIZE_OFFSET)
#define LPC55_USART0_ID                 (LPC55_FLEXCOMM0_BASE + LPC55_USART_ID_OFFSET)

#define LPC55_USART1_CFG                (LPC55_FLEXCOMM1_BASE + LPC55_USART_CFG_OFFSET)
#define LPC55_USART1_CTL                (LPC55_FLEXCOMM1_BASE + LPC55_USART_CTL_OFFSET)
#define LPC55_USART1_STAT               (LPC55_FLEXCOMM1_BASE + LPC55_USART_STAT_OFFSET)
#define LPC55_USART1_INTENSET           (LPC55_FLEXCOMM1_BASE + LPC55_USART_INTENSET_OFFSET)
#define LPC55_USART1_INTENCLR           (LPC55_FLEXCOMM1_BASE + LPC55_USART_INTENCLR_OFFSET)
#define LPC55_USART1_BRG                (LPC55_FLEXCOMM1_BASE + LPC55_USART_BRG_OFFSET)
#define LPC55_USART1_INTSTAT            (LPC55_FLEXCOMM1_BASE + LPC55_USART_INTSTAT_OFFSET)
#define LPC55_USART1_OSR                (LPC55_FLEXCOMM1_BASE + LPC55_USART_OSR_OFFSET)
#define LPC55_USART1_ADDR               (LPC55_FLEXCOMM1_BASE + LPC55_USART_ADDR_OFFSET)
#define LPC55_USART1_FIFOCFG            (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFOCFG_OFFSET)
#define LPC55_USART1_FIFOSTAT           (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFOSTAT_OFFSET)
#define LPC55_USART1_FIFOTRIG           (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFOTRIG_OFFSET)
#define LPC55_USART1_FIFOINTENSET       (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFOINTENSET_OFFSET)
#define LPC55_USART1_FIFOINTENCLR       (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFOINTENCLR_OFFSET)
#define LPC55_USART1_FIFOINTSTAT        (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFOINTSTAT_OFFSET)
#define LPC55_USART1_FIFOWR             (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFOWR_OFFSET)
#define LPC55_USART1_FIFORD             (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFORD_OFFSET)
#define LPC55_USART1_FIFORDNOPOP        (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFORDNOPOP_OFFSET)
#define LPC55_USART1_FIFOSIZE           (LPC55_FLEXCOMM1_BASE + LPC55_USART_FIFOSIZE_OFFSET)
#define LPC55_USART1_ID                 (LPC55_FLEXCOMM1_BASE + LPC55_USART_ID_OFFSET)

#define LPC55_USART2_CFG                (LPC55_FLEXCOMM2_BASE + LPC55_USART_CFG_OFFSET)
#define LPC55_USART2_CTL                (LPC55_FLEXCOMM2_BASE + LPC55_USART_CTL_OFFSET)
#define LPC55_USART2_STAT               (LPC55_FLEXCOMM2_BASE + LPC55_USART_STAT_OFFSET)
#define LPC55_USART2_INTENSET           (LPC55_FLEXCOMM2_BASE + LPC55_USART_INTENSET_OFFSET)
#define LPC55_USART2_INTENCLR           (LPC55_FLEXCOMM2_BASE + LPC55_USART_INTENCLR_OFFSET)
#define LPC55_USART2_BRG                (LPC55_FLEXCOMM2_BASE + LPC55_USART_BRG_OFFSET)
#define LPC55_USART2_INTSTAT            (LPC55_FLEXCOMM2_BASE + LPC55_USART_INTSTAT_OFFSET)
#define LPC55_USART2_OSR                (LPC55_FLEXCOMM2_BASE + LPC55_USART_OSR_OFFSET)
#define LPC55_USART2_ADDR               (LPC55_FLEXCOMM2_BASE + LPC55_USART_ADDR_OFFSET)
#define LPC55_USART2_FIFOCFG            (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFOCFG_OFFSET)
#define LPC55_USART2_FIFOSTAT           (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFOSTAT_OFFSET)
#define LPC55_USART2_FIFOTRIG           (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFOTRIG_OFFSET)
#define LPC55_USART2_FIFOINTENSET       (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFOINTENSET_OFFSET)
#define LPC55_USART2_FIFOINTENCLR       (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFOINTENCLR_OFFSET)
#define LPC55_USART2_FIFOINTSTAT        (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFOINTSTAT_OFFSET)
#define LPC55_USART2_FIFOWR             (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFOWR_OFFSET)
#define LPC55_USART2_FIFORD             (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFORD_OFFSET)
#define LPC55_USART2_FIFORDNOPOP        (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFORDNOPOP_OFFSET)
#define LPC55_USART2_FIFOSIZE           (LPC55_FLEXCOMM2_BASE + LPC55_USART_FIFOSIZE_OFFSET)
#define LPC55_USART2_ID                 (LPC55_FLEXCOMM2_BASE + LPC55_USART_ID_OFFSET)

#define LPC55_USART3_CFG                (LPC55_FLEXCOMM3_BASE + LPC55_USART_CFG_OFFSET)
#define LPC55_USART3_CTL                (LPC55_FLEXCOMM3_BASE + LPC55_USART_CTL_OFFSET)
#define LPC55_USART3_STAT               (LPC55_FLEXCOMM3_BASE + LPC55_USART_STAT_OFFSET)
#define LPC55_USART3_INTENSET           (LPC55_FLEXCOMM3_BASE + LPC55_USART_INTENSET_OFFSET)
#define LPC55_USART3_INTENCLR           (LPC55_FLEXCOMM3_BASE + LPC55_USART_INTENCLR_OFFSET)
#define LPC55_USART3_BRG                (LPC55_FLEXCOMM3_BASE + LPC55_USART_BRG_OFFSET)
#define LPC55_USART3_INTSTAT            (LPC55_FLEXCOMM3_BASE + LPC55_USART_INTSTAT_OFFSET)
#define LPC55_USART3_OSR                (LPC55_FLEXCOMM3_BASE + LPC55_USART_OSR_OFFSET)
#define LPC55_USART3_ADDR               (LPC55_FLEXCOMM3_BASE + LPC55_USART_ADDR_OFFSET)
#define LPC55_USART3_FIFOCFG            (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFOCFG_OFFSET)
#define LPC55_USART3_FIFOSTAT           (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFOSTAT_OFFSET)
#define LPC55_USART3_FIFOTRIG           (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFOTRIG_OFFSET)
#define LPC55_USART3_FIFOINTENSET       (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFOINTENSET_OFFSET)
#define LPC55_USART3_FIFOINTENCLR       (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFOINTENCLR_OFFSET)
#define LPC55_USART3_FIFOINTSTAT        (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFOINTSTAT_OFFSET)
#define LPC55_USART3_FIFOWR             (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFOWR_OFFSET)
#define LPC55_USART3_FIFORD             (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFORD_OFFSET)
#define LPC55_USART3_FIFORDNOPOP        (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFORDNOPOP_OFFSET)
#define LPC55_USART3_FIFOSIZE           (LPC55_FLEXCOMM3_BASE + LPC55_USART_FIFOSIZE_OFFSET)
#define LPC55_USART3_ID                 (LPC55_FLEXCOMM3_BASE + LPC55_USART_ID_OFFSET)

