apache/nuttx/arch/arm/src/lpc55xx/hardware/lpc55_usart.h
#define LPC55_USART4_CFG                (LPC55_FLEXCOMM4_BASE + LPC55_USART_CFG_OFFSET)
#define LPC55_USART4_CTL                (LPC55_FLEXCOMM4_BASE + LPC55_USART_CTL_OFFSET)
#define LPC55_USART4_STAT               (LPC55_FLEXCOMM4_BASE + LPC55_USART_STAT_OFFSET)
#define LPC55_USART4_INTENSET           (LPC55_FLEXCOMM4_BASE + LPC55_USART_INTENSET_OFFSET)
#define LPC55_USART4_INTENCLR           (LPC55_FLEXCOMM4_BASE + LPC55_USART_INTENCLR_OFFSET)
#define LPC55_USART4_BRG                (LPC55_FLEXCOMM4_BASE + LPC55_USART_BRG_OFFSET)
#define LPC55_USART4_INTSTAT            (LPC55_FLEXCOMM4_BASE + LPC55_USART_INTSTAT_OFFSET)
#define LPC55_USART4_OSR                (LPC55_FLEXCOMM4_BASE + LPC55_USART_OSR_OFFSET)
#define LPC55_USART4_ADDR               (LPC55_FLEXCOMM4_BASE + LPC55_USART_ADDR_OFFSET)
#define LPC55_USART4_FIFOCFG            (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFOCFG_OFFSET)
#define LPC55_USART4_FIFOSTAT           (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFOSTAT_OFFSET)
#define LPC55_USART4_FIFOTRIG           (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFOTRIG_OFFSET)
#define LPC55_USART4_FIFOINTENSET       (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFOINTENSET_OFFSET)
#define LPC55_USART4_FIFOINTENCLR       (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFOINTENCLR_OFFSET)
#define LPC55_USART4_FIFOINTSTAT        (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFOINTSTAT_OFFSET)
#define LPC55_USART4_FIFOWR             (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFOWR_OFFSET)
#define LPC55_USART4_FIFORD             (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFORD_OFFSET)
#define LPC55_USART4_FIFORDNOPOP        (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFORDNOPOP_OFFSET)
#define LPC55_USART4_FIFOSIZE           (LPC55_FLEXCOMM4_BASE + LPC55_USART_FIFOSIZE_OFFSET)
#define LPC55_USART4_ID                 (LPC55_FLEXCOMM4_BASE + LPC55_USART_ID_OFFSET)

#define LPC55_USART5_CFG                (LPC55_FLEXCOMM5_BASE + LPC55_USART_CFG_OFFSET)
#define LPC55_USART5_CTL                (LPC55_FLEXCOMM5_BASE + LPC55_USART_CTL_OFFSET)
#define LPC55_USART5_STAT               (LPC55_FLEXCOMM5_BASE + LPC55_USART_STAT_OFFSET)
#define LPC55_USART5_INTENSET           (LPC55_FLEXCOMM5_BASE + LPC55_USART_INTENSET_OFFSET)
#define LPC55_USART5_INTENCLR           (LPC55_FLEXCOMM5_BASE + LPC55_USART_INTENCLR_OFFSET)
#define LPC55_USART5_BRG                (LPC55_FLEXCOMM5_BASE + LPC55_USART_BRG_OFFSET)
#define LPC55_USART5_INTSTAT            (LPC55_FLEXCOMM5_BASE + LPC55_USART_INTSTAT_OFFSET)
#define LPC55_USART5_OSR                (LPC55_FLEXCOMM5_BASE + LPC55_USART_OSR_OFFSET)
#define LPC55_USART5_ADDR               (LPC55_FLEXCOMM5_BASE + LPC55_USART_ADDR_OFFSET)
#define LPC55_USART5_FIFOCFG            (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFOCFG_OFFSET)
#define LPC55_USART5_FIFOSTAT           (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFOSTAT_OFFSET)
#define LPC55_USART5_FIFOTRIG           (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFOTRIG_OFFSET)
#define LPC55_USART5_FIFOINTENSET       (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFOINTENSET_OFFSET)
#define LPC55_USART5_FIFOINTENCLR       (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFOINTENCLR_OFFSET)
#define LPC55_USART5_FIFOINTSTAT        (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFOINTSTAT_OFFSET)
#define LPC55_USART5_FIFOWR             (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFOWR_OFFSET)
#define LPC55_USART5_FIFORD             (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFORD_OFFSET)
#define LPC55_USART5_FIFORDNOPOP        (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFORDNOPOP_OFFSET)
#define LPC55_USART5_FIFOSIZE           (LPC55_FLEXCOMM5_BASE + LPC55_USART_FIFOSIZE_OFFSET)
#define LPC55_USART5_ID                 (LPC55_FLEXCOMM5_BASE + LPC55_USART_ID_OFFSET)

#define LPC55_USART6_CFG                (LPC55_FLEXCOMM6_BASE + LPC55_USART_CFG_OFFSET)
#define LPC55_USART6_CTL                (LPC55_FLEXCOMM6_BASE + LPC55_USART_CTL_OFFSET)
#define LPC55_USART6_STAT               (LPC55_FLEXCOMM6_BASE + LPC55_USART_STAT_OFFSET)
#define LPC55_USART6_INTENSET           (LPC55_FLEXCOMM6_BASE + LPC55_USART_INTENSET_OFFSET)
#define LPC55_USART6_INTENCLR           (LPC55_FLEXCOMM6_BASE + LPC55_USART_INTENCLR_OFFSET)
#define LPC55_USART6_BRG                (LPC55_FLEXCOMM6_BASE + LPC55_USART_BRG_OFFSET)
#define LPC55_USART6_INTSTAT            (LPC55_FLEXCOMM6_BASE + LPC55_USART_INTSTAT_OFFSET)
#define LPC55_USART6_OSR                (LPC55_FLEXCOMM6_BASE + LPC55_USART_OSR_OFFSET)
#define LPC55_USART6_ADDR               (LPC55_FLEXCOMM6_BASE + LPC55_USART_ADDR_OFFSET)
#define LPC55_USART6_FIFOCFG            (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFOCFG_OFFSET)
#define LPC55_USART6_FIFOSTAT           (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFOSTAT_OFFSET)
#define LPC55_USART6_FIFOTRIG           (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFOTRIG_OFFSET)
#define LPC55_USART6_FIFOINTENSET       (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFOINTENSET_OFFSET)
#define LPC55_USART6_FIFOINTENCLR       (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFOINTENCLR_OFFSET)
#define LPC55_USART6_FIFOINTSTAT        (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFOINTSTAT_OFFSET)
#define LPC55_USART6_FIFOWR             (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFOWR_OFFSET)
#define LPC55_USART6_FIFORD             (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFORD_OFFSET)
#define LPC55_USART6_FIFORDNOPOP        (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFORDNOPOP_OFFSET)
#define LPC55_USART6_FIFOSIZE           (LPC55_FLEXCOMM6_BASE + LPC55_USART_FIFOSIZE_OFFSET)
#define LPC55_USART6_ID                 (LPC55_FLEXCOMM6_BASE + LPC55_USART_ID_OFFSET)

#define LPC55_USART7_CFG                (LPC55_FLEXCOMM7_BASE + LPC55_USART_CFG_OFFSET)
#define LPC55_USART7_CTL                (LPC55_FLEXCOMM7_BASE + LPC55_USART_CTL_OFFSET)
#define LPC55_USART7_STAT               (LPC55_FLEXCOMM7_BASE + LPC55_USART_STAT_OFFSET)
#define LPC55_USART7_INTENSET           (LPC55_FLEXCOMM7_BASE + LPC55_USART_INTENSET_OFFSET)
#define LPC55_USART7_INTENCLR           (LPC55_FLEXCOMM7_BASE + LPC55_USART_INTENCLR_OFFSET)
#define LPC55_USART7_BRG                (LPC55_FLEXCOMM7_BASE + LPC55_USART_BRG_OFFSET)
#define LPC55_USART7_INTSTAT            (LPC55_FLEXCOMM7_BASE + LPC55_USART_INTSTAT_OFFSET)
#define LPC55_USART7_OSR                (LPC55_FLEXCOMM7_BASE + LPC55_USART_OSR_OFFSET)
#define LPC55_USART7_ADDR               (LPC55_FLEXCOMM7_BASE + LPC55_USART_ADDR_OFFSET)
#define LPC55_USART7_FIFOCFG            (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFOCFG_OFFSET)
#define LPC55_USART7_FIFOSTAT           (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFOSTAT_OFFSET)
#define LPC55_USART7_FIFOTRIG           (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFOTRIG_OFFSET)
#define LPC55_USART7_FIFOINTENSET       (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFOINTENSET_OFFSET)
#define LPC55_USART7_FIFOINTENCLR       (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFOINTENCLR_OFFSET)
#define LPC55_USART7_FIFOINTSTAT        (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFOINTSTAT_OFFSET)
#define LPC55_USART7_FIFOWR             (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFOWR_OFFSET)
#define LPC55_USART7_FIFORD             (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFORD_OFFSET)
#define LPC55_USART7_FIFORDNOPOP        (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFORDNOPOP_OFFSET)
#define LPC55_USART7_FIFOSIZE           (LPC55_FLEXCOMM7_BASE + LPC55_USART_FIFOSIZE_OFFSET)
#define LPC55_USART7_ID                 (LPC55_FLEXCOMM7_BASE + LPC55_USART_ID_OFFSET)

