apache/nuttx/arch/arm/src/lpc55xx/hardware/lpc55_usart.h
/* USART Register Bitfield Definitions ***************************************************************/

/* USART Configuration register */

#define USART_CFG_ENABLE                (1 << 0)  /* Bit 0  USART Enable */
#define USART_CFG_DATALEN_SHIFT         (2)       /* Bits 2-3: Selects the data size for the USART */
#define USART_CFG_DATALEN_MASK          (3 << USART_CFG_DATALEN_SHIFT)
#  define USART_CFG_DATALEN_7BIT        (0 << USART_CFG_DATALEN_SHIFT) /* 7 bit Data length */
#  define USART_CFG_DATALEN_8BIT        (1 << USART_CFG_DATALEN_SHIFT) /* 8 bit Data length */
#  define USART_CFG_DATALEN_9BIT        (2 << USART_CFG_DATALEN_SHIFT) /* 9 bit data length */
#define USART_CFG_PARITYSEL_SHIFT       (4)       /* Bits 4-5: Selects what type of parity is used by the USART */
#define USART_CFG_PARITYSEL_MASK        (3 << USART_CFG_PARITYSEL_SHIFT)
#  define USART_CFG_PARITYSEL_NONE      (0 << USART_CFG_PARITYSEL_SHIFT) /* No parity */
#  define USART_CFG_PARITYSEL_EVEN      (2 << USART_CFG_PARITYSEL_SHIFT) /* Even parity */
#  define USART_CFG_PARITYSEL_ODD       (3 << USART_CFG_PARITYSEL_SHIFT) /* Odd parity */
#define USART_CFG_STOPLEN               (1 << 6)  /* Bit 6  Number of stop bits appended to transmitted data */
#define USART_CFG_MODE32K               (1 << 7)  /* Bit 7  Selects standard or 32 kHz clocking mode */
#define USART_CFG_LINMODE               (1 << 8)  /* Bit 8  LIN break mode enable */
#define USART_CFG_CTSEN                 (1 << 9)  /* Bit 9  CTS Enable */
#define USART_CFG_SYNCEN                (1 << 11) /* Bit 11 Selects synchronous or asynchronous operation */
#define USART_CFG_CLKPOL                (1 << 12) /* Bit 12 Selects clock polarity and sampling edge of RX data */
#define USART_CFG_SYNCMST               (1 << 14) /* Bit 14 Synchronous mode Master select */
#define USART_CFG_LOOP                  (1 << 15) /* Bit 15 Selects data loopback mode */
#define USART_CFG_OETA                  (1 << 18) /* Bit 18 Output Enable Turnaround time enable for RS-485 operation */
#define USART_CFG_AUTOADDR              (1 << 19) /* Bit 19 Automatic Address matching enable */
#define USART_CFG_OESEL                 (1 << 20) /* Bit 20 Output Enable Select */
#define USART_CFG_OEPOL                 (1 << 21) /* Bit 21 Output Enable Polarity */
#define USART_CFG_RXPOL                 (1 << 22) /* Bit 22 Receive data polarity */
#define USART_CFG_TXPOL                 (1 << 23) /* Bit 23 Transmit data polarity */

/* USART Control register */

#define USART_CTL_TXBRKEN               (1 << 1)  /* Bit 1:  Break Enable */
#define USART_CTL_ADDRDET               (1 << 2)  /* Bit 2:  Enable address detect mode */
#define USART_CTL_TXDIS                 (1 << 6)  /* Bit 6:  Transmit Disable */
#define USART_CTL_CC                    (1 << 8)  /* Bit 8:  Continuous Clock generation */
#define USART_CTL_CLRCCONRX             (1 << 9)  /* Bit 9:  Clear Continuous Clock */
#define USART_CTL_AUTOBAUD              (1 << 16) /* Bit 16: Autobaud enable */

/* USART Status register, USART Interrupt Enable read and Set register, and USART Interrupt Enable Clear register */

#define USART_INTSTAT_RXIDLE            (1 << 1)  /* Bit 1:  Receiver Idle (Status only) */
#define USART_INT_TXIDLE                (1 << 3)  /* Bit 3:  Transmitter Idle */
#define USART_INTSTAT_CTS               (1 << 4)  /* Bit 4:  State of the CTS signal (Status only) */
#define USART_INT_DELTACTS              (1 << 5)  /* Bit 5:  Change in the state of CTS flag */
#define USART_INT_TXDIS                 (1 << 6)  /* Bit 6:  Transmitter Disabled Status flag */
#define USART_INTSTAT_RXBRK             (1 << 10) /* Bit 10: Received Break (Status only) */
#define USART_INT_DELTARXBRK            (1 << 11) /* Bit 11: Change in the state of receiver break detection */
#define USART_INT_START                 (1 << 12) /* Bit 12: Start detected on the receiver input */
#define USART_INT_FRAMERR               (1 << 13) /* Bit 13: Framing Error interrupt flag */
#define USART_INT_PARITYER              (1 << 14) /* Bit 14: Parity Error interrupt flag */
#define USART_INT_RXNOISE               (1 << 15) /* Bit 15: Received Noise interrupt flag */
#define USART_INT_ABERR                 (1 << 16) /* Bit 16: Auto baud Error */

/* USART Baud Rate Generator register  */

#define USART_BRG_SHIFT                 (0)       /* Bits 0-15: BAUD rate divisor */
#define USART_BRG_MASK                  (0xffff << USART_OSR_SHIFT)
#  define USART_BRG(n)                  ((uint32)((n)-1) << USART_OSR_SHIFT)

/* USART Oversample selection register */

#define USART_OSR_SHIFT                 (0)       /* Bits 0-3: Oversample Selection Value. */
#define USART_OSR_MASK                  (15 << USART_OSR_SHIFT)
#  define USART_OSR(n)                  ((uint32)((n)-1) << USART_OSR_SHIFT)

/* FIFO configuration and enable register */

#define USART_FIFOCFG_ENABLETX          (1 << 0)  /* Bit 0:  Enable the transmit FIFO */
#define USART_FIFOCFG_ENABLERX          (1 << 1)  /* Bit 1:  Enable the receive FIFO */
#define USART_FIFOCFG_SIZE_SHIFT        (4)       /* Bits 4-5:  FIFO size configuration */
#define USART_FIFOCFG_SIZE_MASK         (3 << USART_FIFOCFG_SIZE_SHIFT)
#  define USART_FIFOCFG_SIZE_16x8       (0 << USART_FIFOCFG_SIZE_SHIFT) /* FIFO is 16 entries x 8 bits */
#define USART_FIFOCFG_DMATX             (1 << 12) /* Bit 12: DMA configuration for transmit */
#define USART_FIFOCFG_DMARX             (1 << 13) /* Bit 13: DMA configuration for receive */
#define USART_FIFOCFG_WAKETX            (1 << 14) /* Bit 14: Wake-up for transmit FIFO level */
#define USART_FIFOCFG_WAKERX            (1 << 15) /* Bit 15: Wake-up for receive FIFO level */
#define USART_FIFOCFG_EMPTYTX           (1 << 16) /* Bit 16: Empty command for the transmit FIFO */
#define USART_FIFOCFG_EMPTYRX           (1 << 17) /* Bit 17: Empty command for the receive FIFO */

/* FIFO status register */

#define USART_FIFOSTAT_TXERR            (1 << 0)  /* Bit 0  TX FIFO error */
#define USART_FIFOSTAT_RXERR            (1 << 1)  /* Bit 1  RX FIFO error */
#define USART_FIFOSTAT_PERINT           (1 << 3)  /* Bit 3  Peripheral interrupt */
#define USART_FIFOSTAT_TXEMPTY          (1 << 4)  /* Bit 4  Transmit FIFO empty */
#define USART_FIFOSTAT_TXNOTFULL        (1 << 5)  /* Bit 5  Transmit FIFO not full */
#define USART_FIFOSTAT_RXNOTEMPTY       (1 << 6)  /* Bit 6  Receive FIFO not empty */
#define USART_FIFOSTAT_RXFULL           (1 << 7)  /* Bit 7  Receive FIFO full */
#define USART_FIFOSTAT_TXLVL_SHIFT      (8)       /* Bits 8-12: Transmit FIFO current level */
#define USART_FIFOSTAT_TXLVL_MASK       (31 << USART_FIFOSTAT_TXLVL_SHIFT)
#define USART_FIFOSTAT_RXLVL_SHIFT      (16)      /* Bits 16-20: Receive FIFO current level */
#define USART_FIFOSTAT_RXLVL_MASK       (31 << USART_FIFOSTAT_RXLVL_SHIFT)

