apache/nuttx/arch/arm/src/lpc55xx/hardware/lpc55_usart.h
/* FIFO trigger settings for interrupt and DMA request */

#define USART_FIFOTRIG_TXLVLENA         (1 << 0)  /* Bit 0:  Transmit FIFO level trigger enable */
#define USART_FIFOTRIG_RXLVLENA         (1 << 1)  /* Bit 1:  Receive FIFO level trigger enable */
#define USART_FIFOTRIG_TXLVL_SHIFT      (8)       /* Bits 8-11: Transmit FIFO level trigger point */
#define USART_FIFOTRIG_TXLVL_MASK       (15 << USART_FIFOTRIG_TXLVL_SHIFT)
#  define USART_FIFOTRIG_TXLVL(n)       ((uint32_t)(n) << USART_FIFOTRIG_TXLVL_SHIFT) /* Interrupt when n entries */
#  define USART_FIFOTRIG_TXLVL_EMPTY    USART_FIFOTRIG_TXLVL(0)
#  define USART_FIFOTRIG_TXLVL_NOTFULL  USART_FIFOTRIG_TXLVL(15)
#define USART_FIFOTRIG_RXLVL_SHIFT      (16)      /* Bits 16-19: Receive FIFO level trigger point */
#define USART_FIFOTRIG_RXLVL_MASK       (15 << USART_FIFOTRIG_RXLVL_SHIFT)
#  define USART_FIFOTRIG_RXLVL(n)       ((uint32_t)(n) << USART_FIFOTRIG_RXLVL_SHIFT) /* Interrupt when n+1 entries */
#  define USART_FIFOTRIG_RXLVL_NOTEMPY   USART_FIFOTRIG_RXLVL(0)
#  define USART_FIFOTRIG_RXLVL_FULL      USART_FIFOTRIG_RXLVL(15)

/* FIFO interrupt status register, FIFO interrupt enable set (enable), and read register and FIFO interrupt enable
 * clear (disable) and read register
 */

#define USART_FIFOINT_TXERR             (1 << 0)  /* Bit 0:  Transmit FIFO error interrupt */
#define USART_FIFOINT_RXERR             (1 << 1)  /* Bit 1:  Receive ERROR error interrupt */
#define USART_FIFOINT_TXLVL             (1 << 2)  /* Bit 2:  Transmit FIFO level interrupt */
#define USART_FIFOINT_RXLVL             (1 << 3)  /* Bit 3:  Receive FIFO level interrupt */
#define USART_FIFOINTSTAT_PERINT        (1 << 4)  /* Bit 4:  Peripheral interrupt (Status only) */

#define USART_FIFOINT_ALL               0x0000000f

/* FIFO write data */

#define USART_FIFOWR_TXDATA_SHIFT       (0)       /* Bits 0-8:  Transmit data to the FIFO */
#define USART_FIFOWR_TXDATA_MASK        (0x1ff << USART_FIFOWR_TXDATA_SHIFT)
#  define USART_FIFOWR_TXDATA(n)        ((uint32_t)(n) << USART_FIFOWR_TXDATA_SHIFT)

/* FIFO read data register and FIFO data read with no FIFO pop register */

#define USART_FIFORD_RXDATA_SHIFT       (0)       /* Bits 0-8:  Received data from the FIFO */
#define USART_FIFORD_RXDATA_MASK        (0x1ff << USART_FIFOWR_TXDATA_SHIFT)

#define USART_FIFORD_FRAMERR            (1 << 13) /* Bit 13: Framing Error status flag */
#define USART_FIFORD_PARITYERR          (1 << 14) /* Bit 14: Parity Error status flag */
#define USART_FIFORD_RXNOISE            (1 << 15) /* Bit 15: Received Noise flag */

/* USART module Identification */

#define USART_ID_APERTURE_SHIFT         (0)       /* Bits 0-7:   Aperture encoded as (aperture size/4K) -1 */
#define USART_ID_APERTURE_MASKX         (0xff << USART_ID_APERTURE_SHIFT)
#define USART_ID_MINOR_SHIFT            (8)       /* Bits 8-11:  Minor revision of module implementation */
#define USART_ID_MINOR_MASKX            (15 << USART_ID_MINOR_SHIFT)
#define USART_ID_MAJOR_SHIFT            (12)      /* Bits 12-15: Major revision of module implementation */
#define USART_ID_MAJOR_MASKX            (15 << USART_ID_MAJOR_SHIFT)
#define USART_ID_ID_SHIFT               (16)      /* Bits 16-31: ID Unique module identifier for this IP block */
#define USART_ID_ID_MASKX               (0xffff << USART_ID_ID_SHIFT)

#endif /* __ARCH_ARM_SRC_LPC55XX_HARDWARE_LPC55_USART_H */
